
# Алгоритм прямого пошуку підрядка


def string_search(s, x):  # s - задана послідовність, x - шуканий підрядок

    # Поелементне виведення послідовностей s та x:
    print("Задана послідовність: ", end="")
    for i in range(len(s)):
        if i == len(s) - 1:
            print(s[i])
        else:
            print(s[i], end=", ")

    print("Шуканий підрядок: ", end="")
    for i in range(len(x)):
        if i == len(x) - 1:
            print(x[i])
        else:
            print(x[i], end=", ")

    index = x_index = checks = 0  # index - позиція шуканого підрядка
    # x_index - номер елемента підрядка, checks - кількість перевірок
    s_length = len(s)  # s_length - довжина заданої послідовності s
    x_length = len(x)  # x_length - довжина шуканого підрядка x
    # Поелементна перевірка послідовності s на наявність першого елемента x:
    while index <= s_length - x_length and x_index < x_length:
        # Якщо є збіг відбувається перевірка наступних елементів послідовностей
        if s[index + x_index] == x[x_index]:
            x_index += 1
        else:  # В іншому випадку алгоритм переходить на наступний елемент і перевірка відбувається з початку
            index += 1
            x_index = 0
        checks += 1  # З кожною перевіркою збільшується значення checks
        """ 
        Перевірка продовжується доки index є меншим за різницю довжин двох послідовностей. Тобто, якщо після декількох
        перевірок послідовності s залишається кількість елементів, що менша за довжину підрядка x, 
        то перевірка завершується.

        Якщо довжина шуканого підрядка x_length дорівнює значенню x_index, що визначає
        кількість збіжних елементів у послідовностях, то підрядок знайдено і перевірка завершується. Якщо після повної 
        перевірки послідовності s значення x_index менше за x_length, то підрядок не знайдено.
        """

    # При знаходженні x виводиться номер його позиції у послідовності s та кількість перевірок:
    if x_index == x_length:
        print(f"Підрядок знайдено на позиції {index}.")
        print(f"Кількість виконаних порівнянь дорівнює {checks}.")
    else:
        print("Підрядок не знайдено.")


string_search('Direct substring search algorithm', 'sub')
"""
Підрядок знайдено на позиції 7.
Кількість виконаних порівнянь дорівнює 10.
"""

print("───────────────────────────────")
string_search([5, 7, 2, 7, 4, 6, 3, 5], [4, 6])
"""
Підрядок знайдено на позиції 4.
Кількість виконаних порівнянь дорівнює 6.
"""

print("───────────────────────────────")
string_search(range(10, 30), range(23, 35))
"""
Підрядок не знайдено.
"""

# Виконав Іваненко Андрій Вадимович
