
"""
Виведіть на екран елементи лінійного масиву (заданий користувачем) у зворотному порядку.
"""

import numpy as np

answer = '1'
while answer == '1':

    while True:  # Введення довжини лінійного масиву n як цілого числа, що більше нуля:
        try:
            n = int(input("Введіть довжину лінійного масиву:"))
            if n > 0:
                break
            else:
                print("Вводьте правильні дані!")
        except ValueError:
            print("Вводьте правильні дані!")

    array = np.zeros(n, dtype=int)  # Створення лінійного масиву array довжини n, заповненого нулями типу даних int

    print("Введіть значення елементів цього масиву:")
    for i in range(len(array)):  # Поелементне введення значень(типу даних int) для масиву array:
        while True:
            try:
                array[i] = int(input())
                break
            except ValueError:
                print("Вводьте правильні дані!")
            except OverflowError:  # Зловлення помилки щодо занадто великого значення елементу масива
                print("Вводьте правильні дані!")

    print("Цей лінійний масив у зворотному порядку дорівнює:")
    print("|", end=" ")
    for i in range(len(array)):  # Виведення елементів масиву array у зворотньому порядку:
        print(array[-i - 1], "|", end=" ")

    print()
    answer = input("Введіть '1' для повторення:")

# Виконав Іваненко Андрій Вадимович
