
"""
У матриці 4*4, що задана користувачем замініть всі від’ємні елементи на 0.
"""

import numpy as np

answer = '1'
while answer == '1':

    array, maxl = np.zeros((4, 4), dtype=int), 0  # array - заданий масив 4*4, заповнений нулями
    # maxl - змінна для форматного виведення

    print("Введіть значення елементів масиву розмірності 4 на 4:")
    for i in range(4):  # Поелементне введення значення масиву array:
        print(f"Введіть значення {i + 1} рядка:")
        for j in range(4):
            while True:
                try:
                    n = int(input())  # Введення значення n, яке присвоюється елементу масива, якщо воно не є від'ємним
                    if n > 0:
                        array[i][j] = n
                    # В іншому випадку цей елемент залишає значення 0

                    if len(str(n)) > maxl:  # Визначення maxl - максимальної довжини елемента масиву
                        maxl = len(str(n))
                    break
                except ValueError:
                    print("Вводьте правильні дані!")
                except OverflowError:  # Зловлення помилки щодо занадто великого значення елементу масива
                    print("Вводьте правильні дані!")

    # Форматне виведення масиву array у вигляді таблиці:
    print("Цей масив, у якому замінили всі від'ємні значення на нуль, дорівнює:")
    print(f"{'':─^{maxl * 4 + 13}}")
    for i in range(4):
        for j in range(4):
            print(f"| {array[i][j]:^{maxl}} ", end="")
        print("|")
        print(f"{'':─^{maxl * 4 + 13}}")

    answer = input("Введіть '1' для повторення:")

# Виконав Іваненко Андрій Вадимович
