
"""
По найменуванню об'єкта комплектації виводить на екран перелік найменувань виробників об'єкта в наявності
з зазначенням кількості таких об'єктів.
"""

answer = '1'
while answer == '1':

    d = {"процесор": {}, "материнська плата": {}, "пам'ять": {},
         "відео карта": {}, "звукова карта": {}, "вінчестер": {}}
    # d - словник даних про об'єкти комплектації комп'ютера на складі

    # Введення даних про об'єкти комплектації комп'ютера:
    print(f"Вводьте назви виробників для об'єктів комплектації комп'ютера та їх кількість від цих виробників \
(натисніть пробіл для припинення вводу):")
    for i in d:
        print(f" ─ {i}:")
        n1 = n2 = 0
        while True:  # Для кожного об'єкти комплектації записується виробник та їх кількість від цього виробника
            while True:
                try:
                    n1 = input(f"Виробник {len(d[i]) + 1}:")
                    break
                except ValueError:
                    print("Вводьте правильні дані!")
            if n1 == " " or n1 == "":  # Введення продовжується поки не буде записаний пропуск
                break
            while True:
                try:
                    n2 = int(input("Кількість:"))
                    if n2 >= 0:
                        break
                    else:
                        print("Вводьте правильні дані!")
                except ValueError:
                    if n2 == int():
                        break
                    print("Вводьте правильні дані!")
            if n2 == int():
                break
            d[i][n1] = n2

    answer2 = '2'
    while answer2 == '2':

        print("─────────────────────────────────────")
        while True:  # Введення назви об'єкта комплектації із зазначених
            k = input("Введіть назву об'єкта комплектації комп'ютера:")
            if k in d:
                break
            else:
                print("Введіть правильну назву!")

        print("─────────────────────────────────────")
        print("Перелік найменувань виробників для заданого об'єкта комплектації комп'ютера з зазначенням "
              "кількості таких об'єктів в наявності:")
        for i in d[k]:  # Виведення даних про виробників та кількість заданого об'єкта комплектації комп'ютера
            print(f"  {i} - {d[k][i]}")

        # Повторення запиту на назву об'єкта комплектації при введенні користувачем двійки:
        answer2 = input("Введіть '2' для повторення:")

    answer = input("Введіть '1' для повторного введення даних:")

# Виконав Іваненко Андрій Вадимович
